export const Gan = ['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸'];
export const YangGan = ['甲', '丙', '戊', '庚', '壬'];
export const Zhi = ['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥'];
export const YangZhi = ['子', '寅', '辰', '午', '申', '戌'];
export const YinZhi = ['丑', '卯', '巳', '未', '酉', '亥'];
export const JiShen = ['天乙贵人', '天德', '月德', '学堂', '华盖', '将星', '驿马', '天赦', '福德秀气', '福星贵人'];
export const XiongSha = ['丧门', '吊客', '勾神', '绞神', '孤神', '寡宿', '隔角', '咸池', '伏吟', '反吟', '元辰', '劫杀', '破军', '悬针', '平头', '子暗星', '流霞', '冲天杀', '五鬼杀', '红艳', '吞陷', '三丘五墓', '天罗地网', '太白', '斧劈', '孤虚'];
export const GanZhiMap = {
    甲: 'Mu',
    乙: 'Mu',
    寅: 'Mu',
    卯: 'Mu',
    丙: 'Huo',
    丁: 'Huo',
    巳: 'Huo',
    午: 'Huo',
    戊: 'Tu',
    己: 'Tu',
    辰: 'Tu',
    戌: 'Tu',
    丑: 'Tu',
    未: 'Tu',
    庚: 'Jin',
    辛: 'Jin',
    申: 'Jin',
    酉: 'Jin',
    壬: 'Shui',
    癸: 'Shui',
    亥: 'Shui',
    子: 'Shui'
};
// 天乙贵人
const tianyiguiren = {
    甲: ['丑', '未'],
    戊: ['丑', '未'],
    乙: ['子', '申'],
    己: ['子', '申'],
    丙: ['亥', '酉'],
    丁: ['亥', '酉'],
    壬: ['卯', '巳'],
    癸: ['卯', '巳'],
    庚: ['午', '寅'],
    辛: ['午', '寅']
};
// 天德
const tiande = {
    寅: ['丁'],
    卯: ['申'],
    辰: ['壬'],
    巳: ['辛'],
    午: ['亥'],
    未: ['甲'],
    申: ['癸'],
    酉: ['寅'],
    戌: ['丙'],
    亥: ['乙'],
    子: ['子'],
    丑: ['庚']
};
// 月德
const yuede = {
    寅: ['丙'],
    卯: ['甲'],
    辰: ['壬'],
    巳: ['庚'],
    午: ['丙'],
    未: ['甲'],
    申: ['壬'],
    酉: ['庚'],
    戌: ['丙'],
    亥: ['甲'],
    子: ['壬'],
    丑: ['庚']
};
// 学堂
const xuetang = {
    甲: ['亥'],
    乙: ['午'],
    丙: ['寅'],
    丁: ['酉'],
    戊: ['寅'],
    己: ['酉'],
    庚: ['巳'],
    辛: ['子'],
    壬: ['申'],
    癸: ['卯']
};
// 华盖
const huagai = {
    寅: ['戌'],
    午: ['戌'],
    戌: ['戌'],
    亥: ['未'],
    卯: ['未'],
    未: ['未'],
    申: ['辰'],
    子: ['辰'],
    辰: ['辰'],
    巳: ['丑'],
    酉: ['丑'],
    丑: ['丑']
};
// 将星
const jiangxing = {
    寅: ['午'],
    午: ['午'],
    戌: ['午'],
    亥: ['卯'],
    卯: ['卯'],
    未: ['卯'],
    申: ['子'],
    子: ['子'],
    辰: ['子'],
    巳: ['酉'],
    酉: ['酉'],
    丑: ['酉']
};
// 驿马
const yima = {
    寅: ['申'],
    午: ['申'],
    戌: ['申'],
    亥: ['巳'],
    卯: ['巳'],
    未: ['巳'],
    申: ['寅'],
    子: ['寅'],
    辰: ['寅'],
    巳: ['亥'],
    酉: ['亥'],
    丑: ['亥']
};
// 丧门
const sangmen = {
    寅: ['辰'],
    卯: ['巳'],
    辰: ['午'],
    巳: ['未'],
    午: ['申'],
    未: ['酉'],
    申: ['戌'],
    酉: ['亥'],
    戌: ['子'],
    亥: ['丑'],
    子: ['寅'],
    丑: ['卯']
};
// 吊客
const diaoke = {
    寅: ['子'],
    卯: ['丑'],
    辰: ['寅'],
    巳: ['卯'],
    午: ['辰'],
    未: ['巳'],
    申: ['午'],
    酉: ['未'],
    戌: ['申'],
    亥: ['酉'],
    子: ['戌'],
    丑: ['亥']
};
// 勾神
// 阳男阴女
const goushenyang = {
    寅: ['巳'],
    卯: ['午'],
    辰: ['未'],
    巳: ['申'],
    午: ['酉'],
    未: ['戌'],
    申: ['亥'],
    酉: ['子'],
    戌: ['丑'],
    亥: ['寅'],
    子: ['卯'],
    丑: ['辰']
};
// 阴男阳女
const goushenyin = {
    寅: ['亥'],
    卯: ['子'],
    辰: ['丑'],
    巳: ['寅'],
    午: ['卯'],
    未: ['辰'],
    申: ['巳'],
    酉: ['午'],
    戌: ['未'],
    亥: ['申'],
    子: ['酉'],
    丑: ['戌']
};
// 绞神
// 阳男阴女
const jiaoshenyang = {
    寅: ['亥'],
    卯: ['子'],
    辰: ['丑'],
    巳: ['寅'],
    午: ['卯'],
    未: ['辰'],
    申: ['巳'],
    酉: ['午'],
    戌: ['未'],
    亥: ['申'],
    子: ['酉'],
    丑: ['戌']
};
// 阴男阳女
const jiaoshenyin = {
    寅: ['巳'],
    卯: ['午'],
    辰: ['未'],
    巳: ['申'],
    午: ['酉'],
    未: ['戌'],
    申: ['亥'],
    酉: ['子'],
    戌: ['丑'],
    亥: ['寅'],
    子: ['卯'],
    丑: ['辰']
};
// 孤神
const gushen = {
    寅: ['巳'],
    卯: ['巳'],
    辰: ['巳'],
    巳: ['申'],
    午: ['申'],
    未: ['申'],
    申: ['亥'],
    酉: ['亥'],
    戌: ['亥'],
    亥: ['寅'],
    子: ['寅'],
    丑: ['寅']
};
// 寡宿
const guaxiu = {
    寅: ['丑'],
    卯: ['丑'],
    辰: ['丑'],
    巳: ['辰'],
    午: ['辰'],
    未: ['辰'],
    申: ['未'],
    酉: ['未'],
    戌: ['未'],
    亥: ['戌'],
    子: ['戌'],
    丑: ['戌']
};
// 咸池
const xianchi = {
    寅: ['卯'],
    午: ['卯'],
    戌: ['卯'],
    亥: ['巳'],
    卯: ['巳'],
    未: ['巳'],
    申: ['酉'],
    子: ['酉'],
    辰: ['酉'],
    巳: ['午'],
    酉: ['午'],
    丑: ['午']
};
// 元辰
const yuanchenyang = {
    寅: ['酉'],
    卯: ['戌'],
    辰: ['亥'],
    巳: ['子'],
    午: ['丑'],
    未: ['寅'],
    申: ['卯'],
    酉: ['辰'],
    戌: ['巳'],
    亥: ['午'],
    子: ['未'],
    丑: ['申']
};
const yuanchenyin = {
    寅: ['未'],
    卯: ['申'],
    辰: ['酉'],
    巳: ['戌'],
    午: ['亥'],
    未: ['子'],
    申: ['丑'],
    酉: ['寅'],
    戌: ['卯'],
    亥: ['辰'],
    子: ['巳'],
    丑: ['午']
};
// 劫杀
const jiesha = {
    寅: ['亥'],
    午: ['亥'],
    戌: ['亥'],
    亥: ['申'],
    卯: ['申'],
    未: ['申'],
    申: ['巳'],
    子: ['巳'],
    辰: ['巳'],
    巳: ['寅'],
    酉: ['寅'],
    丑: ['寅']
};
// 破军
const pojun = {
    寅: ['巳'],
    午: ['巳'],
    戌: ['巳'],
    亥: ['寅'],
    卯: ['寅'],
    未: ['寅'],
    申: ['亥'],
    子: ['亥'],
    辰: ['亥'],
    巳: ['申'],
    酉: ['申'],
    丑: ['申']
};
const zianxing = {};
// 流霞
const liuxia = {
    甲: ['酉'],
    戊: ['巳'],
    乙: ['戌'],
    己: ['午'],
    丙: ['未'],
    丁: ['申'],
    壬: ['亥'],
    癸: ['寅'],
    庚: ['辰'],
    辛: ['卯']
};
// 红艳
const hongyan = {
    甲: ['午'],
    戊: ['辰'],
    乙: ['申'],
    己: ['辰'],
    丙: ['寅'],
    丁: ['未'],
    壬: ['子'],
    癸: ['申'],
    庚: ['戌'],
    辛: ['酉']
};
// 吞陷
const tunxia = {};
// 三丘五墓
const sanqiuwumu = {};
// 天罗地网
const tianluodiwang = {};
// 太白
const taibai = {};
// 斧劈
const fupi = {};
// 孤虚
const guxu = {};
const wuguisha = {};
const tianshe = {};
const fudexiuqi = {};
const fuxingguiren = {};
export const JiShenTrans = {tianyiguiren, tiande, yuede, xuetang, huagai, jiangxing, yima, tianshe, fudexiuqi, fuxingguiren};
export const XiongShaTrans = {sangmen, diaoke, goushenyang, goushenyin, jiaoshenyang, jiaoshenyin, gushen, guaxiu, xianchi, yuanchenyang, yuanchenyin, jiesha, pojun, zianxing, liuxia, wuguisha, hongyan, tunxia, sanqiuwumu, tianluodiwang, taibai, fupi, guxu};
